# DetailCurve Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DetailCurve Class
Members See Also
---
A curve that is used to create a detail drawing. A detail curve is visible only in the view in which it is drawn.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class DetailCurve : CurveElement
```

Visual Basic
---
```text
Public Class DetailCurve _
	Inherits CurveElement
```

Visual C++
---
```text
public ref class DetailCurve : public CurveElement
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..CurveElement Autodesk.Revit.DB..::..DetailCurve Autodesk.Revit.DB..::..DetailArc Autodesk.Revit.DB..::..DetailEllipse Autodesk.Revit.DB..::..DetailLine Autodesk.Revit.DB..::..DetailNurbSpline
# See Also
DetailCurve Members
Autodesk.Revit.DB Namespace